//BATCH02  JOB CLASS=B,MSGCLASS=X
//* IN-STREAM PROC WITH SYMBOLIC DEFAULTS, INVOKED WITH AN OVERRIDE
//MYPROC   PROC OUTCLS=A,RETAIN=7
//PSTEP1   EXEC PGM=SORTPGM
//SORTIN   DD DSN=PROD.INPUT.FILE,DISP=SHR
//SORTOUT  DD DSN=PROD.OUTPUT.FILE,DISP=(NEW,CATLG,DELETE)
//SYSOUT   DD SYSOUT=&OUTCLS
//PSTEP2   EXEC PGM=PURGE,PARM='&RETAIN'
//PURGEIN  DD DSN=PROD.OUTPUT.FILE,DISP=SHR
//         PEND
//RUN01    EXEC MYPROC,OUTCLS=Z
