       IDENTIFICATION DIVISION.
       PROGRAM-ID. R1301.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FILE-A ASSIGN TO "R1301A.DAT"
               ORGANIZATION IS LINE SEQUENTIAL
               FILE STATUS IS FS-A.
       DATA DIVISION.
       FILE SECTION.
       FD  FILE-A.
       01  REC-A               PIC X(10).
       WORKING-STORAGE SECTION.
       01  FS-A                PIC X(2).
       PROCEDURE DIVISION.
       DECLARATIVES.
       INPUT-HANDLER SECTION.
           USE AFTER STANDARD ERROR PROCEDURE ON INPUT.
       INPUT-HANDLER-PARA.
           DISPLAY "MODE-HANDLER FIRED FS-A=" FS-A.
       FILE-A-HANDLER SECTION.
           USE AFTER STANDARD ERROR PROCEDURE ON FILE-A.
       FILE-A-HANDLER-PARA.
           DISPLAY "FILE-HANDLER FIRED FS-A=" FS-A.
       END DECLARATIVES.
       MAIN-PARA.
           OPEN INPUT FILE-A.
           DISPLAY "AFTER OPEN A FS-A=" FS-A.
           STOP RUN.
