       IDENTIFICATION DIVISION.
       PROGRAM-ID. E06.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SRC PIC X(10) VALUE "ABCDEFGHIJ".
       01 WS-RESULT PIC X(5) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARA.
           CALL "E06SUB" USING WS-SRC(3:5) WS-RESULT.
           DISPLAY "RESULT=" WS-RESULT.
           STOP RUN.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. E06SUB.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-IN PIC X(5).
       01 LS-OUT PIC X(5).
       PROCEDURE DIVISION USING LS-IN LS-OUT.
       SUB-PARA.
           MOVE LS-IN TO LS-OUT.
           GOBACK.
       END PROGRAM E06SUB.
       END PROGRAM E06.
