       IDENTIFICATION DIVISION.
       PROGRAM-ID. F01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SRC PIC X(10) VALUE "34567890AB".
       01 WS-NUM PIC 9(4) VALUE ZERO.
       01 WS-DEC PIC 9(3)V99 VALUE ZERO.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-SRC(3:4) TO WS-NUM.
           DISPLAY "NUM=" WS-NUM.
           MOVE WS-SRC(1:5) TO WS-DEC.
           DISPLAY "DEC=" WS-DEC.
           STOP RUN.
