       IDENTIFICATION DIVISION.
       PROGRAM-ID. F02.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SRC PIC X(10) VALUE "ABCDEFGHIJ".
       01 WS-LEN PIC 9(2) VALUE ZERO.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "FULLEN=" FUNCTION LENGTH(WS-SRC).
           DISPLAY "SUBLEN=" FUNCTION LENGTH(WS-SRC(3:4)).
           MOVE FUNCTION LENGTH(WS-SRC(2:5)) TO WS-LEN.
           DISPLAY "MOVEDLEN=" WS-LEN.
           STOP RUN.
