       IDENTIFICATION DIVISION.
       PROGRAM-ID. F03.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SRC PIC X(10) VALUE "3456789012".
       01 WS-ELEM PIC X(4) OCCURS 5 VALUE "ZZZZ".
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE "BBBB" TO WS-ELEM(2).
           MOVE "CCCC" TO WS-ELEM(3).
           DISPLAY "NUMVAL=" FUNCTION NUMVAL(WS-SRC(3:4)).
           DISPLAY "ELEM=" WS-ELEM(FUNCTION NUMVAL(WS-SRC(1:1))).
           STOP RUN.
