       IDENTIFICATION DIVISION.
       PROGRAM-ID. F04.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SRC PIC X(10) VALUE "ABCDEFGHIJ".
       01 WS-POS PIC X(1) VALUE "3".
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "OUTER=" WS-SRC(FUNCTION NUMVAL(WS-POS(1:1)) : 4).
           STOP RUN.
