       IDENTIFICATION DIVISION.
       PROGRAM-ID. F05.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SOURCE PIC X(10) VALUE "PQRSTUVWXY".
       01 WS-GRP-A.
          05 FLD-ONE PIC X(4) VALUE SPACES.
          05 FLD-TWO PIC 9(3) VALUE ZERO.
       01 WS-GRP-B.
          05 FLD-ONE PIC X(4) VALUE SPACES.
          05 FLD-TWO PIC 9(3) VALUE ZERO.
          05 FLD-THREE PIC X(2) VALUE "ZZ".
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-SOURCE(2:4) TO FLD-ONE OF WS-GRP-A.
           MOVE 456 TO FLD-TWO OF WS-GRP-A.
           MOVE CORRESPONDING WS-GRP-A TO WS-GRP-B.
           DISPLAY "B1=" FLD-ONE OF WS-GRP-B.
           DISPLAY "B2=" FLD-TWO OF WS-GRP-B.
           DISPLAY "B3=" FLD-THREE OF WS-GRP-B.
           STOP RUN.
