       IDENTIFICATION DIVISION.
       PROGRAM-ID. N10SUBCOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-REC1.
           05 WS-AMT1   PIC S9(5)V99 VALUE 100.50.
           05 WS-QTY1   PIC S9(3)    VALUE 10.
           05 WS-ONLY1  PIC S9(3)    VALUE 5.
       01 WS-REC2.
           05 WS-AMT1   PIC S9(5)V99 VALUE 30.25.
           05 WS-QTY1   PIC S9(3)    VALUE 4.
           05 WS-ONLY2  PIC S9(3)    VALUE 9.
       PROCEDURE DIVISION.
       MAIN-PARA.
           SUBTRACT CORRESPONDING WS-REC1 FROM WS-REC2
           DISPLAY "AMT=" WS-AMT1 OF WS-REC2
           DISPLAY "QTY=" WS-QTY1 OF WS-REC2
           DISPLAY "ONLY2=" WS-ONLY2
           STOP RUN.
