       IDENTIFICATION DIVISION.
       PROGRAM-ID. U02COMPF.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-F1  COMP-1 VALUE 3.5.
       01 WS-F2  COMP-2 VALUE 2.25.
       01 WS-F3  COMP-1.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY WS-F1.
           DISPLAY WS-F2.
           COMPUTE WS-F3 = WS-F1 * 2.0.
           DISPLAY WS-F3.
           STOP RUN.
