       IDENTIFICATION DIVISION.
       PROGRAM-ID. U03B.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AMT       PIC 9(3)V99 VALUE 123,45.
       01 WS-EDIT      PIC ZZ9,99.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-AMT TO WS-EDIT.
           DISPLAY "EDIT=" WS-EDIT.
           DISPLAY "RAW=" WS-AMT.
           STOP RUN.
