       IDENTIFICATION DIVISION.
       PROGRAM-ID. U11B.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 WS-A PIC X(4) VALUE "ABCD".
          05 WS-B PIC X(4) VALUE "WXYZ".
       01 WS-TARGET PIC X(8) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-GROUP TO WS-TARGET.
           DISPLAY "T=[" WS-TARGET "]".
           STOP RUN.
