       IDENTIFICATION DIVISION.
       PROGRAM-ID. V05B.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-EDIT      PIC Z.ZZZ,99.
       01 WS-AMT       PIC 9(4)V99 VALUE 1234,56.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-AMT TO WS-EDIT.
           DISPLAY "EDIT=" WS-EDIT.
           STOP RUN.
