       IDENTIFICATION DIVISION.
       PROGRAM-ID. V05C.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR       PIC X(8) VALUE "123,45".
       01 WS-NUM       PIC 9(4)V99 VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE FUNCTION NUMVAL(WS-STR) TO WS-NUM.
           DISPLAY "NUMVAL=" WS-NUM.
           STOP RUN.
