       IDENTIFICATION DIVISION.
       PROGRAM-ID. W06.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR    PIC X(10) VALUE "ABCABCABCA".
       PROCEDURE DIVISION.
       MAIN-PARA.
           INSPECT WS-STR CONVERTING "ABC" TO "BCA".
           DISPLAY "RESULT=" WS-STR.
           STOP RUN.
