       IDENTIFICATION DIVISION.
       PROGRAM-ID. W08.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SRC    PIC X(10) VALUE "HELLOWORLD".
       01 WS-DEST   PIC X(5) JUSTIFIED RIGHT.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-SRC TO WS-DEST.
           DISPLAY "DEST=[" WS-DEST "]".
           STOP RUN.
