       IDENTIFICATION DIVISION.
       PROGRAM-ID. W11.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DVD    PIC 9(4)V9(4) VALUE 7.5000.
       01 WS-DVS    PIC 9(4)V9(4) VALUE 2.0000.
       01 WS-QUOT   PIC 9(4)V9(4).
       01 WS-REM    PIC 9(4)V9(4).
       PROCEDURE DIVISION.
       MAIN-PARA.
           DIVIDE WS-DVD BY WS-DVS GIVING WS-QUOT REMAINDER WS-REM.
           DISPLAY "QUOT=" WS-QUOT " REM=" WS-REM.
           STOP RUN.
