       IDENTIFICATION DIVISION.
       PROGRAM-ID. W13.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A      PIC 9(4)V99 VALUE 10.
       01 WS-B      PIC 9(4)V99 VALUE 3.
       01 WS-MRES   PIC 9(4)V9(1).
       01 WS-DRES   PIC 9(4)V9(1).
       PROCEDURE DIVISION.
       MAIN-PARA.
           MULTIPLY WS-A BY WS-B GIVING WS-MRES ROUNDED.
           DISPLAY "MULT-ROUNDED=" WS-MRES.
           DIVIDE WS-A BY WS-B GIVING WS-DRES ROUNDED.
           DISPLAY "DIV-ROUNDED=" WS-DRES.
           STOP RUN.
