       IDENTIFICATION DIVISION.
       PROGRAM-ID. ODOWRITE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUT-FILE ASSIGN TO "ODOWRITE.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD OUT-FILE.
       01 OUT-REC.
           05 OUT-COUNT PIC 9(2).
           05 OUT-ITEM  OCCURS 1 TO 5 TIMES
               DEPENDING ON OUT-COUNT
               PIC 9(3).
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN OUTPUT OUT-FILE.
           MOVE 2 TO OUT-COUNT.
           MOVE 111 TO OUT-ITEM(1).
           MOVE 222 TO OUT-ITEM(2).
           WRITE OUT-REC.
           CLOSE OUT-FILE.
           STOP RUN.
