       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDCORRR2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SRC.
           05 WS-A PIC 9(3)V99 VALUE 0.06.
       01 WS-DST.
           05 WS-A PIC 9(3)V9 VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           ADD CORRESPONDING WS-SRC TO WS-DST ROUNDED.
           DISPLAY "DST-A=" WS-A OF WS-DST.
           STOP RUN.
