       IDENTIFICATION DIVISION.
       PROGRAM-ID. FEWCHECK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A PIC 9(4) VALUE 10.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "BEFORE A=" WS-A.
           CALL "SUBY" USING WS-A.
           DISPLAY "AFTER  A=" WS-A.
           STOP RUN.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LK-A PIC 9(4).
       01 LK-B PIC 9(4).
       PROCEDURE DIVISION USING LK-A, LK-B.
       SUBY-PARA.
           ADD 1 TO LK-A.
           GOBACK.
       END PROGRAM SUBY.
       END PROGRAM FEWCHECK.
